Autodesk.Revit.DB.SpecUtils.GetParameterType(Autodesk.Revit.DB.ForgeTypeId)
Gets the ParameterType value corresponding to the given spec identifier.
specTypeId:
The spec identifier.
Returns:
The ParameterType value corresponding to the given spec identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SpecUtils.GetSpecTypeId(Autodesk.Revit.DB.ParameterType)
Gets the ForgeTypeId identifying the spec corresponding to the given ParameterType value.
parameterType:
The ParameterType value.
Returns:
Identifier of the spec corresponding to the given ParameterType value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022